org/daily/2021-11-04.org
:PROPERTIES:
:ID:       A32739C2-CBE0-46AF-88FA-C088565F6C1E
:END:
#+title: 2021-11-04
#+HUGO_SECTION:daily
#+filetags: :draft:
#+filetags: :draft:
* [[id:B92A7F7E-2E72-4816-917C-2A8CCBD6EEC8][5-step-analysis]] analysis
** Goal list
*** Goals
**** [#A] Be a man that act. 
**** [#A] Discover a way to code brain.
***** Being albe to study as a neuralscientist
****** Score in University
**** [#A] Be a great computer Hacker
***** Have great math skill
**** [#A] Have strong & flexible body
**** [#A] Live with fun & art

**** [#B] Have a good relationship
**** [#B] Have ability to play good jazz piano
**** [#B] Shoot well
**** [#B] Live and work in a community with communism atmosphere
**** [#B] Write Brilliant literature
**** [#B] Be a philosopher with rich knowledge and strong thinking ability

**** [#C] Make music
**** [#C] Being able to draw well
**** [#C] Be a great engineer
**** [#C] Be a brilliant visual artist
**** [#C] Be a bondage master
**** [#C] Live tidily

*** Desires
**** [#A] Enjoy Art
**** [#A] Be cozy in place
**** [#A] Hangout with my friends and have fun

**** [#B] Be good looking
**** [#B] Be a sex master
**** [#B] Have sexual pleasure

**** [#C] Have good food and drinks
**** [#C] Have a person/symbol to rely on
*** Assosaries
**** [#B] Make a lot of money
** Problem list
*** Get distract easily
When doing one thing, I can easily just run into another thing and sink in itx
[[*Be a man that act.][Be a man that act.]]

*** Forget about the scheme easily
*** Give up to do things easily
*** Trap in media too easily
*** Mind not too open to accept other's opinion
*** Get lazy easily
*** Have no self-discipline
*** Always doing entertaining things rather than hard things
*** Always procrastinate on exploring things I'm not familiar with
*** Have no good note method to have thoughts collected
Procrastination.
*** always forget to exercise in the middle of day
*** Resist hard work
*** DOn't read mail and posts due to laziness
*** Have no care to my relationships
*** Don't have plan on my body
*** Too easy to fall into regular paradigm of everything
*** DOn't practice writing
*** Don't practice piano nor have a plan of ultra it
*** Don't relate principles in doing things
*** Have no principles tested working nor easy ways to find them.
*** Procrastinate everything
*** Casually have no energy to do anything
*** fear to communicate with others(teacher or fellow student) when left behind
*** Focus easy to parish
*** Improvising everything while the passion would parish easily
*** Being unsteady
*** Can't decide to give up which, end up giveing up everything
** Cause list
*** Lack of Self discipline
[[Get distract easily]] and [[Trap in media too easily]]
*** No framework of reminding/bring about schemes
[[Forget about the scheme easily]]
*** Not commited enough into my Goals
[[Forget about the scheme easily]] and [[Trap in media too easily]]
[[*DOn't practice writing][DOn't practice writing]]
[[*Don't practice piano nor have a plan of ultra it][Don't practice piano nor have a plan of ultra it]]
[[*fear to communicate with others(teacher or fellow student) when left behind][fear to communicate with others(teacher or fellow student) when left behind]]

*** lack of Open-mindedness
[[Mind not too open to accept other's opinion]]
*** I'm lazy
[[Get lazy easily]]
*** The Tendency to follow the tradition.
[[Forget about the scheme easily]]
[[Trap in media too easily]]
[[Mind not too open to accept other's opinion]]
[[Get lazy easily]]
*** Afraid of unfamilliar things
Instead of what I thought I am--a brave explorer--I'm afraid of unfamilliar things, and is sick about them.
[[*Always doing entertaining things rather than hard things][Always doing entertaining things rather than hard things]]
[[Always procrastinate on exploring things I'm not familiar with][Always procrastinate on exploring things I'm not familiar with]]
[[*fear to communicate with others(teacher or fellow student) when left behind][fear to communicate with others(teacher or fellow student) when left behind]]

*** [#A] Mind too blind, urge and lifeless, instead of calm and outsider as it should be
I should be able to watch my deeds from out side, checking my background sound principles all the time, confirming of every movements if they converge to the principles and noting them.
[[*always forget to exercise in the middle of day][always forget to exercise in the middle of day]]
*** Easy Perished interest. and ignorance of the relation of the tasks to the Goals
[[*Resist hard work][Resist hard work]]
[[*Casually have no energy to do anything][Casually have no energy to do anything]]

*** [#A] My passion of performing a strategy.
It could be a double-edged sword.
I'm really fascinated by the idea of performing a strategy, like that in LOL, other games, reading novels(click to next page), masturbating--all the stuff that I don't really know what will be the result, but I have a image of it, whether it's totally imaginary or empirical.
The idea of having a prediction of future, and act to realize it caught me.

That's also source of my interest of learning how to write every sound and paragraph I see. I want to be able to make everything I senced. That's what I say when I refer to [[id:F1E6F424-6DD8-462A-B2C3-AD0EE8CD579F][Artist]] and [[id:9C7D0D76-725F-45D6-B84A-4F75C11E164F][Engineer]].

This relationship is worth examine and use.

also, it contributes to my resistence to things I'm not familiar with, with no paradigm or principle to follow.


[[*Always doing entertaining things rather than hard things][Always doing entertaining things rather than hard things]]
[[*DOn't read mail and posts due to laziness][DOn't read mail and posts due to laziness]]
[[*Casually have no energy to do anything][Casually have no energy to do anything]]

