content/daily/2021-11-04.md
+++
title = "2021-11-04"
author = ["System Administrator"]
tags = ["draft", "draft"]
draft = false
+++

## [5-step-analysis]({{< relref "../20220509205143-5_step_analysis.md" >}}) analysis {#5-step-analysis--dot-dot-20220509205143-5-step-analysis-dot-md--analysis}


### Goal list {#goal-list}


#### Goals {#goals}

<!--list-separator-->

-  Be a man that act.

<!--list-separator-->

-  Discover a way to code brain.

    <!--list-separator-->

    -  Being albe to study as a neuralscientist

        <!--list-separator-->

        -  Score in University

<!--list-separator-->

-  Be a great computer Hacker

    <!--list-separator-->

    -  Have great math skill

<!--list-separator-->

-  Have strong &amp; flexible body

<!--list-separator-->

-  Live with fun &amp; art

<!--list-separator-->

-  Have a good relationship

<!--list-separator-->

-  Have ability to play good jazz piano

<!--list-separator-->

-  Shoot well

<!--list-separator-->

-  Live and work in a community with communism atmosphere

<!--list-separator-->

-  Write Brilliant literature

<!--list-separator-->

-  Be a philosopher with rich knowledge and strong thinking ability

<!--list-separator-->

-  Make music

<!--list-separator-->

-  Being able to draw well

<!--list-separator-->

-  Be a great engineer

<!--list-separator-->

-  Be a brilliant visual artist

<!--list-separator-->

-  Be a bondage master

<!--list-separator-->

-  Live tidily


#### Desires {#desires}

<!--list-separator-->

-  Enjoy Art

<!--list-separator-->

-  Be cozy in place

<!--list-separator-->

-  Hangout with my friends and have fun

<!--list-separator-->

-  Be good looking

<!--list-separator-->

-  Be a sex master

<!--list-separator-->

-  Have sexual pleasure

<!--list-separator-->

-  Have good food and drinks

<!--list-separator-->

-  Have a person/symbol to rely on


#### Assosaries {#assosaries}

<!--list-separator-->

-  Make a lot of money


### Problem list {#problem-list}


#### Get distract easily {#get-distract-easily}

When doing one thing, I can easily just run into another thing and sink in itx
[Be a man that act.](#be-a-man-that-act-dot)


#### Forget about the scheme easily {#forget-about-the-scheme-easily}


#### Give up to do things easily {#give-up-to-do-things-easily}


#### Trap in media too easily {#trap-in-media-too-easily}


#### Mind not too open to accept other's opinion {#mind-not-too-open-to-accept-other-s-opinion}


#### Get lazy easily {#get-lazy-easily}


#### Have no self-discipline {#have-no-self-discipline}


#### Always doing entertaining things rather than hard things {#always-doing-entertaining-things-rather-than-hard-things}


#### Always procrastinate on exploring things I'm not familiar with {#always-procrastinate-on-exploring-things-i-m-not-familiar-with}


#### Have no good note method to have thoughts collected {#have-no-good-note-method-to-have-thoughts-collected}

Procrastination.


#### always forget to exercise in the middle of day {#always-forget-to-exercise-in-the-middle-of-day}


#### Resist hard work {#resist-hard-work}


#### DOn't read mail and posts due to laziness {#don-t-read-mail-and-posts-due-to-laziness}


#### Have no care to my relationships {#have-no-care-to-my-relationships}


#### Don't have plan on my body {#don-t-have-plan-on-my-body}


#### Too easy to fall into regular paradigm of everything {#too-easy-to-fall-into-regular-paradigm-of-everything}


#### DOn't practice writing {#don-t-practice-writing}


#### Don't practice piano nor have a plan of ultra it {#don-t-practice-piano-nor-have-a-plan-of-ultra-it}


#### Don't relate principles in doing things {#don-t-relate-principles-in-doing-things}


#### Have no principles tested working nor easy ways to find them. {#have-no-principles-tested-working-nor-easy-ways-to-find-them-dot}


#### Procrastinate everything {#procrastinate-everything}


#### Casually have no energy to do anything {#casually-have-no-energy-to-do-anything}


#### fear to communicate with others(teacher or fellow student) when left behind {#fear-to-communicate-with-others--teacher-or-fellow-student--when-left-behind}


#### Focus easy to parish {#focus-easy-to-parish}


#### Improvising everything while the passion would parish easily {#improvising-everything-while-the-passion-would-parish-easily}


#### Being unsteady {#being-unsteady}


#### Can't decide to give up which, end up giveing up everything {#can-t-decide-to-give-up-which-end-up-giveing-up-everything}


### Cause list {#cause-list}


#### Lack of Self discipline {#lack-of-self-discipline}

[Get distract easily](#get-distract-easily) and [Trap in media too easily](#trap-in-media-too-easily)


#### No framework of reminding/bring about schemes {#no-framework-of-reminding-bring-about-schemes}

[Forget about the scheme easily](#forget-about-the-scheme-easily)


#### Not commited enough into my Goals {#not-commited-enough-into-my-goals}

[Forget about the scheme easily](#forget-about-the-scheme-easily) and [Trap in media too easily](#trap-in-media-too-easily)
[DOn't practice writing](#don-t-practice-writing)
[Don't practice piano nor have a plan of ultra it](#don-t-practice-piano-nor-have-a-plan-of-ultra-it)
[fear to communicate with others(teacher or fellow student) when left behind](#fear-to-communicate-with-others--teacher-or-fellow-student--when-left-behind)


#### lack of Open-mindedness {#lack-of-open-mindedness}

[Mind not too open to accept other's opinion](#mind-not-too-open-to-accept-other-s-opinion)


#### I'm lazy {#i-m-lazy}

[Get lazy easily](#get-lazy-easily)


#### The Tendency to follow the tradition. {#the-tendency-to-follow-the-tradition-dot}

[Forget about the scheme easily](#forget-about-the-scheme-easily)
[Trap in media too easily](#trap-in-media-too-easily)
[Mind not too open to accept other's opinion](#mind-not-too-open-to-accept-other-s-opinion)
[Get lazy easily](#get-lazy-easily)


#### Afraid of unfamilliar things {#afraid-of-unfamilliar-things}

Instead of what I thought I am--a brave explorer--I'm afraid of unfamilliar things, and is sick about them.
[Always doing entertaining things rather than hard things](#always-doing-entertaining-things-rather-than-hard-things)
[Always procrastinate on exploring things I'm not familiar with](#always-procrastinate-on-exploring-things-i-m-not-familiar-with)
[fear to communicate with others(teacher or fellow student) when left behind](#fear-to-communicate-with-others--teacher-or-fellow-student--when-left-behind)


#### Mind too blind, urge and lifeless, instead of calm and outsider as it should be {#mind-too-blind-urge-and-lifeless-instead-of-calm-and-outsider-as-it-should-be}

I should be able to watch my deeds from out side, checking my background sound principles all the time, confirming of every movements if they converge to the principles and noting them.
[always forget to exercise in the middle of day](#always-forget-to-exercise-in-the-middle-of-day)


#### Easy Perished interest. and ignorance of the relation of the tasks to the Goals {#easy-perished-interest-dot-and-ignorance-of-the-relation-of-the-tasks-to-the-goals}

[Resist hard work](#resist-hard-work)
[Casually have no energy to do anything](#casually-have-no-energy-to-do-anything)


#### My passion of performing a strategy. {#my-passion-of-performing-a-strategy-dot}

It could be a double-edged sword.
I'm really fascinated by the idea of performing a strategy, like that in LOL, other games, reading novels(click to next page), masturbating--all the stuff that I don't really know what will be the result, but I have a image of it, whether it's totally imaginary or empirical.
The idea of having a prediction of future, and act to realize it caught me.

That's also source of my interest of learning how to write every sound and paragraph I see. I want to be able to make everything I senced. That's what I say when I refer to [Artist]({{< relref "../main/20211008134350-artist.md" >}}) and [Engineer]({{< relref "../main/20211102001428-engineer.md" >}}).

This relationship is worth examine and use.

also, it contributes to my resistence to things I'm not familiar with, with no paradigm or principle to follow.

[Always doing entertaining things rather than hard things](#always-doing-entertaining-things-rather-than-hard-things)
[DOn't read mail and posts due to laziness](#don-t-read-mail-and-posts-due-to-laziness)
[Casually have no energy to do anything](#casually-have-no-energy-to-do-anything)
