content/daily/2021-11-04.md


#### Little care of what's being done &amp; Genius worship {#little-care-of-what-s-being-done-and-genius-worship}

I have little care of my work and deeds, the things I figured out.

That's the cause of myself not reviewing or practicing anything or acting with my principles.

Such might trace back to my [Genius worship]({{< relref "../main/20211107233555-genius_worship.md" >}}).

I think that all things happened to me will stick forever, because I'm a genius. Same worship to muscle memory also exist, that I should practice something to muscle memory and it sticks forever.

Truth is the odd of it happening second time is the odd they have happened before: 1 time in 18 years, or 10 times in a week. This is a usage of the tradition.

Meanwhile, such worship also stands for my almightiness, that I could finish everything within a tap.

Truth is that I could do anything but not everything. Time is never enough, and is critical.


#### Too much concern on the way others see me--Low self-esteem {#too-much-concern-on-the-way-others-see-me-low-self-esteem}

low self-esteem seem to be a major cause.
I don't want others look down on me, don't want them think me as a lazy, stupid, unprofesstional, ignorant, foolish kid, though I really am one.

I fear the true nature of myself, while worshiping beatiful characteristics, like 007's professional skills and style, like being on principles. I convince myself that these natures are all inside me in the distance of one call.

It's true that they are one call far. But if I don't call, they won't be present, due to the distance, and the reality of my true nature. I know the strategy and the image, but not the reality. I hate this reality, so I'm not looking it.

I should not be caring of others opinions about me. These are going to change anyway, my goals, on the other hand, would stick. I now know the strategy. I'm dying to see the image.

[fear to communicate with others(teacher or fellow student) when left behind](#fear-to-communicate-with-others--teacher-or-fellow-student--when-left-behind)


#### Focus too nervous {#focus-too-nervous}

Could be due to [Too much concern on the way others see me--Low self-esteem](#too-much-concern-on-the-way-others-see-me-low-self-esteem).
I'm easy to get nervous instead of excited and relax.

The examples is the tension on my forehead. Such tension will come up when ever I want to focus, especially when reading not familiar texts like English or Math, or Academic things.

I'm forced to raise my forhead tension, reading out, getting nervous on not familiar things. New songs could be another example. I could do much more dynamic and steady flow on an old song of mine but only squeezed scream on new songs.

Gotta be relaxed. especially for focus.

[Focus easy to parish](#focus-easy-to-parish)
[Improvising everything while the passion would parish easily](#improvising-everything-while-the-passion-would-parish-easily)


#### Imcapablity to give up {#imcapablity-to-give-up}

I can't give up anything.

Things become valuable when I reexamine them and throw out some.


### Solution {#solution}


#### Review {#review}

<!--list-separator-->

-  Good things

    -   I have immplemented [Emacs]({{< relref "../main/20211012152715-emacs.md" >}}) along with org-mode and org-roam for my note-taking
    -   I have being using principles and machines as main percpectives of my life and planning
    -   I have decided my Goals.
    -   I have set up my mind for a grind with strategy to my goals. to step in to mystery

<!--list-separator-->

-  Going through

    -   Several major crash on life machine
        The whole life stop working and I have done nothing except basic living need.
    -   some moment that the machine works.. no , not that have happened.
    -   abondon the whole structure at least 3 times:(paper, roam, obsidian)
    -   Going to shoot for 1 month. 5 times back to Suzhou.
    -   2 whole semester of inactive learning
    -   a successful math exam and spanish exam preparation using Anki
    -   Some serious coursework disaster due to mismanagement.
    -   Complete blind in path to my goals.

<!--list-separator-->

-  Bad things

    -   Messed up my first girlfriend and second one
    -   Trying to be a mentor of everyone around me, telling them something they don't need and I don't understand.
    -   Missing lots of opportunities either too late to find out or too lazy to participate
    -   Spending lots of time on desires with no contribution to my goals while messed up my feelings afterwards
    -   Forgetting and not connectting to my friends for long long time.
    -   Staying up too late and completely messed up my schedules
    -   Missing too much courses that start to think that can not go to them, for its useless and I can't understand with the gap.


#### Future {#future}

<!--list-separator-->

-  start

    -   Building relationship for my goals
        -   with knowledgable people
        -   with cooperators
    -   Be more Open-mindedn
    -   Seizing every opportunity to my goals, with priorities
    -   Do whatever it take to score in University
    -   Start reseach now a Pathaway to my endpoint state of discovering ways to code brain
    -   Establish exercise schedule with track and process standard, always asking what to do next.
    -   A complete task management system with handy queries
    -   Always have my place clean and artful
    -   Establish machine to bring about my Principles
    -   Do everything with image and strategy/principle in mind and log
    -   Establish note-taking system for revision purpose
    -   Have a place to hold all my golden statments of belief and principles
    -   Start learning and prepare for university works now
    -   Start learning coding and algorithm and math now


#### Machine-modifications {#machine-modifications}

<!--list-separator-->

-  General task doing machine

    Establish general step, rules and principles for tasks.
    e.g: Calm awareness during tasks. focus fall on the behind of head. Stay outsider and evaluating what's being done. I'm the genius of my own.

    maybe a focus submachine

    Coorperate with general scheme

    Add relating tasks to goals step

    Add strategy/principle indication and image step. That could open up my passion to see the result. Add log step.

    Add brief review of privious work step. Summary privious works.

    add Process controal submachine

    Incooperate little exercise to warm body and releae tension to keep productivity

    Add Improvisation part. Add strategy/principle check step, to search for available strategy/principle to use in improvisation. Add recording of casual found of strategy/principle for improvisation

<!--list-separator-->

-  Scheme machine

    categorize/navigate Ways to do schemes. weekly plan/project plan/ultra project/...

    A socket to check scheme every needed time

    ensure all tasks looks not hard. break hard works down in the scheme session

    A regular review of all things been done, in process and future scheme.
    Keep track with my CV

<!--list-separator-->

-  Media control machine

    Goal related media control machine to restrict research in focused area and moderate the desire part of media consumption

<!--list-separator-->

-  Lazy Button machine

    A button to evac me from lazy-mode into either relax/rest/regenerate-mode or exciting/interested-mode

    Could have multiple solutions like inspiration(from golden statements and storys) or goals or strategies

<!--list-separator-->

-  Advising machine

    How to seek advise and accept advices with open-mindness and conscious judgement.

    Add communication with peers and mentors part. Add ways and functions to communicate with them. Add awareness: self-esteem and reality ([Too much concern on the way others see me--Low self-esteem](#too-much-concern-on-the-way-others-see-me-low-self-esteem))

<!--list-separator-->

-  Tasks management machine

    Should make the tasks more concrete and limited and clear.
    State strategy/principle
    add State out the relation of the tasks to the goals and result image/not doing image

    Add queries index.

<!--list-separator-->

-  Entertainment Control machine

    Add time/content restriction and reason with relation to the goals.

<!--list-separator-->

-  Exploring/Research machine
