org/daily/2021-11-04.org
**** Exploring/Research machine
Make clear strategies and algorithms. Better have real functions that can be used.

Add background principle about evolution to mystery and braveness to mystery
**** Note taking machine
Incooperate Journaling, Questioning, Task capture, Working notes, Learning notes/knowledge database, event agenda. make sure whenever I want to note down something, it's been taken care of automatically.

Add log submachine [[id:32C68C01-E94C-4993-8977-71457F72CECD][Log Machine]]. Add socket in general task doing machine

Org-capture could be of great help. make templates
**** Information Updating Machine
Include:
+ Website RSS Feeds
+ Blog feeds
+ Mailbox(mail.xjtlu)
+ Wechat groups
+ Ebridge
+ Learning mall
+ Texting Inbox

Update information on a regular time period(1d for e.g.)
Collect information and decide what to do about it. Add decision pools and functions of the actions.

What to do with the event messages?
could Incooperate with [[Tasks management machine]]

Add Opportunity Submachine for spotting and patch managing Opportunity(prioritizing, giving up, selecting, putting into project...)
**** Relation machine 
Relation maintainance on a time/event period. (A thought on my mind?)

Trace contact with relations using org-capture. especially for people I don't usually remember to keep contact with.

Keep a list of things want to talk about to talk about in a mild and continuous manner?

Keep track of my rare relation network for my goals. Incooperate with Advise machine and Information Updating machine
**** Health machine
Add eating part. Guideline for eating and nutrition. log for eating and nutrition

Add exercise part. navigate exercise projects(machine in shape of chain or tree). Add track of exercise. Add process standard. Add asking what to do next step.

Add Medical part. navigate body problems and medical info. Regular medical session, and appointment planning/reservation submachine.

Add Energy control part. Experiment on energy distribution of a day and after certain event like stay up late, exercise, eating special food, large task session, .etc. Add energy recover strategies including eating chocolates or drinking waters
**** Mental Environment Machine
Add Belief checking/review/record part. Keep track of beliefs and principles. Keep list of Golden statments, model storys, key concepts

Have a regular review session.

Add info of genius worship and low self-esteem with reality.
**** Skill maintain machine
Skills have a odd point that ones cross, little effort could be made to maintain.

Still, need regular practice to maintain skills to the current state. Add method to evaluate the state if it's changing

Establish way to detact if the odd point is crossed.

Add track to all skills I posses
**** Experiment machine
Add socket for log machine.

Experiment on principles.

Add experiment flow/principle/strategies part.

Add how to experiment and keep track of a principle's experiment.

Add track to all principles/strategies/flow/portion/method/function in experiment. Could use tags or backlink(quoting in the experiment place).

Add tested working principles part. maybe a standalone list(because it might be long)
**** Give up machine
Add give up standard. evaluate when to give up something. Add give up routine, how to give up something, if they need some ceremony.
**** Refresh machine
Add periodically reexamine of goals and roles and schemes.

Add reexamine of machines

Add review of machines
**** [[id:7FDF98A0-7C62-4F02-A5D9-1087B4AEE001][Household Machine]]
Add awareness: goal-"live artfully and with fun"
**** [[id:4972A60D-3727-4422-B73F-BAF3289C1DB8][Academic Machine]]
Information update.
Add new tasks in light of the goal "score in university" and "study as a neuralscientist"
**** [[id:391C5CF3-2A11-4BC3-ADE3-6F8C6E557B82][Neuralscientist]] role: becoming part
Research for pathaway to become a Neural scientist.
Mail professors for information.
Add a scheme for the becoming part. Make a project machine of the becoming part afterwards.
Add project machine of university required content learning and tracking.
**** [[id:9C7D0D76-725F-45D6-B84A-4F75C11E164F][Engineer]] role: becoming part
Add project mahcine of learning algorithm
Add project machine of learning math(discrete)


*** ACTIVE Solution list [5/26]                           :agenda:solution:
**** DONE Finish the solution list
CLOSED: [2021-11-14 Sun 23:20]
:LOGBOOK:
- State "DONE"       from "WEEK"       [2021-11-14 Sun 23:20]
:END:
Translate the [[Machine-modifications]] part into concrete SOLUTIONs and Tasks.
**** DONE Modify [[id:E48DECC9-A139-4F6D-B6F6-62B3570959D6][General task doing machine[9/9]]]
CLOSED: [2021-11-14 Sun 23:46]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:46]
:END:
***** DONE General Establishment
CLOSED: [2021-11-14 Sun 23:28]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:28]
:END:
Flows and principles
+ Calm awareness during task
+ Focus fall on behind of head
+ Stay outsider/evaluating what's being done
+ Genius of my own
***** DONE Add Focus submachine
CLOSED: [2021-11-14 Sun 23:28]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:28]
:END:
Find strategy/principle in Ultralearning
***** DONE Add socket for general scheme
CLOSED: [2021-11-14 Sun 23:30]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:30]
:END:
A place to review on the scheme of the task, and other schemes
***** DONE Add relating tasks to goals step
CLOSED: [2021-11-14 Sun 23:30]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:30]
:END:
***** DONE Add strategy/principle indication and image step
CLOSED: [2021-11-14 Sun 23:33]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:33]
:END:
Note that it's for motivation.
***** DONE Add brief revew of privious work step.
CLOSED: [2021-11-14 Sun 23:35]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:35]
:END:
Summarize privious work on the task/scheme in 1 sentence
***** DONE [#A] Add [[id:5DCD9BFB-53BD-41EB-A37E-E00FF5FBABBD][Process Control Machine]] submachine
CLOSED: [2021-11-14 Sun 23:38]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:38]
:END:
***** DONE Add middle exercise step
CLOSED: [2021-11-14 Sun 23:46]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:46]
:END:
periodically exercise every 30 minutes.
Set alarm/reminder for that.
System crafter have relating content of pormordor timer
***** DONE Add Improvisation part.
CLOSED: [2021-11-14 Sun 23:45]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:45]
:END:
****** DONE Add strategy/principle check step
CLOSED: [2021-11-14 Sun 23:45]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:45]
:END:
Clear navigate for where to find the strategy/principles

Should be devide into categories. In devided notes.

include:
+ Prioritze-always. Do the most important part of the tasks first
  
****** DONE Add recording of finding of strategy/principle for improvisation.
CLOSED: [2021-11-14 Sun 23:45]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:45]
:END:
Notes are Improvising Jazz, Improvising Math and such.
Heading ~InboX~ is for recording. Check it periodically.
**** DONE Build My Website and blog.
CLOSED: [2021-11-14 Sun 23:49]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:49]
:END:
Sharing and potential attention attracted make me excited.
Community and personal record also would be benefited.
***** DONE Name
CLOSED: [2021-11-14 Sun 23:49]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:49]
:END:
Name the website, and buy it from a cheap platform.
I like hermanhel.github.io now
