content/daily/2021-11-04.md

    Make clear strategies and algorithms. Better have real functions that can be used.

    Add background principle about evolution to mystery and braveness to mystery

<!--list-separator-->

-  Note taking machine

    Incooperate Journaling, Questioning, Task capture, Working notes, Learning notes/knowledge database, event agenda. make sure whenever I want to note down something, it's been taken care of automatically.

    Add log submachine [Log Machine]({{< relref "../main/20211007132712-log_machine.md" >}}). Add socket in general task doing machine

    Org-capture could be of great help. make templates

<!--list-separator-->

-  Information Updating Machine

    Include:

    -   Website RSS Feeds
    -   Blog feeds
    -   Mailbox(mail.xjtlu)
    -   Wechat groups
    -   Ebridge
    -   Learning mall
    -   Texting Inbox

    Update information on a regular time period(1d for e.g.)
    Collect information and decide what to do about it. Add decision pools and functions of the actions.

    What to do with the event messages?
    could Incooperate with [Tasks management machine](#tasks-management-machine)

    Add Opportunity Submachine for spotting and patch managing Opportunity(prioritizing, giving up, selecting, putting into project...)

<!--list-separator-->

-  Relation machine

    Relation maintainance on a time/event period. (A thought on my mind?)

    Trace contact with relations using org-capture. especially for people I don't usually remember to keep contact with.

    Keep a list of things want to talk about to talk about in a mild and continuous manner?

    Keep track of my rare relation network for my goals. Incooperate with Advise machine and Information Updating machine

<!--list-separator-->

-  Health machine

    Add eating part. Guideline for eating and nutrition. log for eating and nutrition

    Add exercise part. navigate exercise projects(machine in shape of chain or tree). Add track of exercise. Add process standard. Add asking what to do next step.

    Add Medical part. navigate body problems and medical info. Regular medical session, and appointment planning/reservation submachine.

    Add Energy control part. Experiment on energy distribution of a day and after certain event like stay up late, exercise, eating special food, large task session, .etc. Add energy recover strategies including eating chocolates or drinking waters

<!--list-separator-->

-  Mental Environment Machine

    Add Belief checking/review/record part. Keep track of beliefs and principles. Keep list of Golden statments, model storys, key concepts

    Have a regular review session.

    Add info of genius worship and low self-esteem with reality.

<!--list-separator-->

-  Skill maintain machine

    Skills have a odd point that ones cross, little effort could be made to maintain.

    Still, need regular practice to maintain skills to the current state. Add method to evaluate the state if it's changing

    Establish way to detact if the odd point is crossed.

    Add track to all skills I posses

<!--list-separator-->

-  Experiment machine

    Add socket for log machine.

    Experiment on principles.

    Add experiment flow/principle/strategies part.

    Add how to experiment and keep track of a principle's experiment.

    Add track to all principles/strategies/flow/portion/method/function in experiment. Could use tags or backlink(quoting in the experiment place).

    Add tested working principles part. maybe a standalone list(because it might be long)

<!--list-separator-->

-  Give up machine

    Add give up standard. evaluate when to give up something. Add give up routine, how to give up something, if they need some ceremony.

<!--list-separator-->

-  Refresh machine

    Add periodically reexamine of goals and roles and schemes.

    Add reexamine of machines

    Add review of machines

<!--list-separator-->

-  [Household Machine]({{< relref "../main/20211011010036-household_machine.md" >}})

    Add awareness: goal-"live artfully and with fun"

<!--list-separator-->

-  [Academic Machine]({{< relref "../main/20211011005922-academic_machine.md" >}})

    Information update.
    Add new tasks in light of the goal "score in university" and "study as a neuralscientist"

<!--list-separator-->

-  [Neuralscientist]({{< relref "../main/20211012021721-neuralscientist.md" >}}) role: becoming part

    Research for pathaway to become a Neural scientist.
    Mail professors for information.
    Add a scheme for the becoming part. Make a project machine of the becoming part afterwards.
    Add project machine of university required content learning and tracking.

<!--list-separator-->

-  [Engineer]({{< relref "../main/20211102001428-engineer.md" >}}) role: becoming part

    Add project mahcine of learning algorithm
    Add project machine of learning math(discrete)


#### ACTIVE Solution list <code>[5/26]</code> <span class="tag"><span class="agenda">agenda</span><span class="solution">solution</span></span> {#active-solution-list}

<!--list-separator-->

- <span class="org-todo done DONE">DONE</span>  Finish the solution list

    Translate the [Machine-modifications](#machine-modifications) part into concrete SOLUTIONs and Tasks.

<!--list-separator-->

- <span class="org-todo done DONE">DONE</span>  Modify [General task doing machine[9/9]({{< relref "../main/20211108153719-general_task_doing_machine.md" >}})]

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  General Establishment

        Flows and principles

        -   Calm awareness during task
        -   Focus fall on behind of head
        -   Stay outsider/evaluating what's being done
        -   Genius of my own

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Add Focus submachine

        Find strategy/principle in Ultralearning

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Add socket for general scheme

        A place to review on the scheme of the task, and other schemes

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Add relating tasks to goals step

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Add strategy/principle indication and image step

        Note that it's for motivation.

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Add brief revew of privious work step.

        Summarize privious work on the task/scheme in 1 sentence

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Add [Process Control Machine]({{< relref "../main/20211108154329-process_control_machine.md" >}}) submachine

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Add middle exercise step

        periodically exercise every 30 minutes.
        Set alarm/reminder for that.
        System crafter have relating content of pormordor timer

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Add Improvisation part.

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  Add strategy/principle check step

            Clear navigate for where to find the strategy/principles

            Should be devide into categories. In devided notes.

            include:

            -   Prioritze-always. Do the most important part of the tasks first

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  Add recording of finding of strategy/principle for improvisation.

            Notes are Improvising Jazz, Improvising Math and such.
            Heading `InboX` is for recording. Check it periodically.

<!--list-separator-->

- <span class="org-todo done DONE">DONE</span>  Build My Website and blog.

    Sharing and potential attention attracted make me excited.
    Community and personal record also would be benefited.

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  Name

        Name the website, and buy it from a cheap platform.
        I like hermanhel.github.io now

    <!--list-separator-->

    - <span class="org-todo done DONE">DONE</span>  server
