org/daily/2021-11-04.org
***** DONE server
CLOSED: [2021-11-14 Sun 23:49]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:49]
:END:
Rent a server from GigsGigsCloud
don't need one currently
***** DONE Implement website
CLOSED: [2021-11-14 Sun 23:46]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:46]
:END:
Build a node for the website.
Check System Crafter's post on website with org-mode

Structure of the website.
Blogs, Concepts, Journaling...
***** DONE Write my first post.
CLOSED: [2021-11-14 Sun 23:46]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-14 Sun 23:46]
:END:
**** TODO Build Scheme machine [/]
:PROPERTIES:
:Effort:   0:10
:END:
:LOGBOOK:
CLOCK: [2021-11-15 Mon 17:28]--[2021-11-15 Mon 17:38] =>  0:10
:END:
***** TODO Add Making part
****** TODO categorize/navigate ways to do schmes
Weekly plan/project plan/ultra project/...
****** TODO Add principle
Easy task: make tasks look easy, clear, with wise strategy/principle.

Small task: break hard/long task into small ones

***** TODO Add Checking part
****** TODO add A socket to check scheme conveniently.
***** TODO Add review part
****** TODO Navigate scheme
Done, inprocess and future scheme.
****** TODO Add tags and link speci in schemes for review purpose
****** TODO Add CV track function
My deeds recorded on website or in CV. a function for that. Add a CV node.
**** DONE Build Media Control machine.
CLOSED: [2021-11-16 Tue 14:14]
:PROPERTIES:
:Effort:   30
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-11-16 Tue 14:14]
CLOCK: [2021-11-16 Tue 13:48]--[2021-11-16 Tue 14:10] =>  0:22
:END:
***** DONE Add restrict part
CLOSED: [2021-11-16 Tue 14:14]
:LOGBOOK:
- State "DONE"       from "DONE"       [2021-11-16 Tue 14:14]
- State "DONE"       from "TODO"       [2021-11-16 Tue 14:14]
:END:
part for media control in research and task doing
***** DONE Add moderate part
CLOSED: [2021-11-16 Tue 14:14]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-11-16 Tue 14:14]
:END:
part for media control for desire and pleasure.
**** TODO Build Lazy Button machine
***** TODO Add modes part
Rest-mode and exciting-mode.
***** TODO Add solution part
including inpiration, goals and strategy stimulate.
inspiration related to mental environment machine's golden statements .etc
**** TODO Build Advising machine
***** TODO Add strategy/principle part
****** TODO For seeking
****** TODO For accepting.
****** TODO For evaluating
Ray dalio have suggestion in /Principles/
***** TODO Add awareness
Self-esteem and reality
***** TODO add communication with part
Keep a list of people to communicate with and area.
****** TODO peers
****** TODO mentors
**** TODO Build Tasks management machine
**** DONE Build Entertainment Control machine
CLOSED: [2021-12-22 Wed 17:06]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-12-22 Wed 17:06]
CLOCK: [2021-12-22 Wed 16:59]--[2021-12-22 Wed 17:06] =>  0:07
:END:
**** TODO Learn CPT101 content
The  missing part in the CPT101 machine is the gap between my knowledge of the course contents and the current teaching plan.

To Solve the problem, simply learn the contents.
**** TODO Prepare for EAP121 presentation
***** TODO Write script
***** TODO Make PPT
***** TODO Practice present
**** TODO Exploring/Research machine
***** TODO Add strategies for research.
***** TODO Add background principles
evolution to mystery
braveness to mystery
**** TODO Notetaking machine
***** TODO Add navigation
+ Journaling
+ Questioning
+ Tasks capture
+ Working notes
+ Learning notes/knowledge database
+ Event agenda
+ Shopping list
***** TODO Add socket to [[id:32C68C01-E94C-4993-8977-71457F72CECD][Log Machine]]
***** TODO Add socket to General task doing machine
***** TODO Make Org-capture template accordingly
**** TODO Information Updating Machine
***** TODO Add periodically update scheme
Include:
+ Website RSS Feeds
+ Blog feeds
+ Mailbox(mail.xjtlu)
+ Wechat groups
+ Ebridge
+ Learning mall
+ Texting Inbox

Time period could vary
***** TODO Add Processing to the info
****** TODO add decision pool
This could be log of decisions on the informations in the past.

When I know more about the decision making in regard to the processing of information, More algorithm could be established.
***** TODO Add opportunity submachine
****** TODO Patch managing opportunities
could use org-capture
**** TODO Build relation Machine
Later. [[Relation machine]]
**** TODO Health machine
***** TODO Add eating Part
Guideline for eating and nutrition. log for eating and nutrition
***** TODO Add exercise part.
 navigate exercise projects(machine in shape of chain or tree). Add track of exercise. Add process standard. Add asking what to do next step.
***** TODO Add Medical part.
 navigate body problems and medical info. Regular medical session, and appointment planning/reservation submachine.
***** TODO Add Energy control part
 Experiment on energy distribution of a day and after certain event like stay up late, exercise, eating special food, large task session, .etc. Add energy recover strategies including eating chocolates or drinking waters
**** TODO Build Mental Environment Machine
***** TODO Add Belief checking/review/record part
. Keep track of beliefs and principles. Keep list of Golden statments, model storys, key concepts

***** TODO Have a regular review session.

***** TODO Add info of genius worship and low self-esteem with reality.
**** TODO Build Skill maintain Machine

***** TODO Way to detact odd point

***** TODO Add Track to skills

**** TODO build experiment Machine

