org/daily/2021-11-04.org
***** TODO Add socket for log machine.

***** TODO Experiment on principles.

***** TODO Add experiment flow/principle/strategies part.

***** TODO Add how to experiment and keep track of a principle's experiment.

***** TODO Add track to all principles/strategies/flow/portion/method/function in experiment.

Could use tags or backlink(quoting in the experiment place).

***** TODO Add tested working principles part.
maybe a standalone list(because it might be long)

**** TODO Build Give up machine and refresh Machine

**** TODO Academic Machine
***** TODO Apply information update machine to academic machine

**** NEXT Research for pathaway to become a Neural scientist.
Mail professors for information.
**** TODO Add a scheme for the becoming part.
Make a project machine of the becoming part afterwards.
**** TODO Add project machine of university required content learning and tracking.
**** TODO Add project machine of learning algorithm
**** TODO Add project machine of learning math(discrete)

