content/daily/2021-11-04.md

-  NEXT Research for pathaway to become a Neural scientist.

    Mail professors for information.

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Add a scheme for the becoming part.

    Make a project machine of the becoming part afterwards.

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Add project machine of university required content learning and tracking.

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Add project machine of learning algorithm

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  Add project machine of learning math(discrete)